{"posts":[{"title":"KO","text":"INITIATORKAY/O is a machine of war built for a single purpose: neutralizing radiants. His power to suppress enemy abilities cripples his opponents’ capacity to fight back, securing him and his allies the ultimate edge. Q - FLASH/DRIVEEQUIP a flash grenade. FIRE to throw. The flash grenade explodes after a short fuse, blinding anyone in line of sight. E - ZERO/POINTEQUIP a suppression blade. FIRE to throw. The blade sticks to the first surface it hits, winds up, and suppresses anyone in the radius of the explosion. C - FRAG/MENTEQUIP an explosive fragment. FIRE to throw. The fragment sticks to the floor and explodes multiple times, dealing near lethal damage at the center with each explosion. X - NULL/CMDINSTANTLY overload with polarized radianite energy that empowers KAY/O and causes large energy pulses to emit from his location. Enemies hit with these pulses are suppressed for a short duration.","link":"/2023/09/06/ko/"},{"title":"Neon","text":"DUELISTFilipino Agent Neon surges forward at shocking speeds, discharging bursts of bioelectric radiance as fast as her body generates it.She races ahead to catch enemies off guard, then strikes them down quicker than lightning. Q - RELAY BOLTINSTANTLY throw an energy bolt that bounces once. Upon hitting each surface, the bolt electrifies the ground below with a concussive blast. E - HIGH GEARINSTANTLY channel Neon’s power for increased speed. When charged, ALT FIRE to trigger an electric slide. Slide charge resets every two kills. C - FAST LANEFIRE two energy lines forward on the ground that extend a short distance or until they hit a surface. The lines rise into walls of static electricity that block vision and damage enemies passing through them. X - OVERDRIVEUnleash Neon’s full power and speed for a short duration. FIRE to channel the power into a deadly lightning beam with high movement accuracy. The duration resets on each kill.","link":"/2023/09/06/neon/"}],"tags":[{"name":"valorant","slug":"valorant","link":"/tags/valorant/"},{"name":"ko","slug":"ko","link":"/tags/ko/"},{"name":"neon","slug":"neon","link":"/tags/neon/"}],"categories":[{"name":"Valorant","slug":"Valorant","link":"/categories/Valorant/"},{"name":"ko","slug":"Valorant/ko","link":"/categories/Valorant/ko/"},{"name":"neon","slug":"Valorant/neon","link":"/categories/Valorant/neon/"}],"pages":[]}